
&НаКлиенте
Процедура УслугаНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуга.ТекущиеДанные;  
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Сумма = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Номенклатура,Неопределено);
	Иначе
		СтрокаТЧ.Сумма = 0;		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ПроверкаОказанияУслуги=Документы.ЗаписьКлиента.ПроверитьОказаниеУслуг(Объект.Ссылка);
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.УслугаОказана = Ложь; 
	ИначеЕсли ПроверкаОказанияУслуги <> Ложь Тогда
		Объект.УслугаОказана = Истина; 
	Иначе
		Объект.УслугаОказана = Ложь; 

	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда

		Если Параметры.Свойство("Начало") Тогда 
		Объект.ДатаЗаписи = Параметры.Начало;
		КонецЕсли;

		Если Параметры.Свойство("Окончание") Тогда
		Объект.ДатаОкончанияЗаписи = Параметры.Окончание;
		КонецЕсли;

		Если Параметры.Свойство("Сотрудник") Тогда
		Объект.Сотрудник = Параметры.Сотрудник;
		КонецЕсли;

		Если ЗначениеЗаполнено(Объект.ДатаЗаписи) Тогда
		Объект.Дата = НачалоДня(Объект.ДатаЗаписи);
		КонецЕсли;    

	КонецЕсли;

	УстановитьДоступностьЭлементовФормы()	
	


КонецПроцедуры       

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
    Если НЕ РольДоступна("Администратор") Тогда
        Элементы.УслугаОказана.ТолькоПросмотр = Истина;
    КонецЕсли;        
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    Оповестить("Записан заказ");
КонецПроцедуры