&НаКлиенте
Процедура ПослеОтветаНаВопросОбОчисткеТЧ(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Начисления.Очистить();
		ЗаполнитьАвтоматическиНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоматическиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ПродажиОбороты.Сотрудник КАК Сотрудник,
	              |	ПродажиОбороты.СуммаОборот КАК Сумма
	              |ИЗ
	              |	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ПродажиОбороты
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Сотрудник";
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Объект.ПериодНачисления));

	ВыборкаДетальные = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальные.Следующий() Цикл  
			СтрокаТЧ = Объект.Начисления.Добавить();
			СтрокаТЧ.Сотрудник = ВыборкаДетальные.Сотрудник;
			СтрокаТЧ.ВидРасчета = ПланыВидовРасчета.Начисления.НайтиПоКоду("ПРОЦПРОД");
			СтрокаТЧ.ПоказательРасчета = ВыборкаДетальные.Сумма;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоматически(Команда)
	ТекстВопроса = "Будет очищена табличная часть документа. Вы согласны продолжить?";
    Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбОчисткеТЧ", ЭтаФорма);
    ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,"Внимание!");


	
КонецПроцедуры
