Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(АвторДокумента) Тогда
		АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	СуммаДокумента = Услуги.Итог("Сумма");
	
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
 
	Движения.УчетЗатрат.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.УчетЗатрат.Добавить();
		Движение.Период = Дата;
		Движение.СтатьяЗатрат = ТекСтрокаУслуги.СтатьяЗатрат;
		Движение.Сумма = ТекСтрокаУслуги.Сумма;
	КонецЦикла;

    Движения.Хозрасчетный.Записывать = Истина;
	СчетКредита = ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеУслугУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	ПоступлениеУслугУслуги.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета,
	               |	ПоступлениеУслугУслуги.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.ПоступлениеУслуг.Услуги КАК ПоступлениеУслугУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеУслуг КАК ПоступлениеУслуг
	               |		ПО ПоступлениеУслугУслуги.Ссылка = ПоступлениеУслуг.Ссылка
	               |ГДЕ
	               |	ПоступлениеУслуг.Ссылка = &Ссылка
	               |ИТОГИ ПО
	               |	СтатьяЗатрат";
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл
		Выборка=ВыборкаИтоги.Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Движения.Хозрасчетный.Добавить();   
			Движение.СчетДт = Выборка.СчетБухгалтерскогоУчета;
			Движение.СчетКт = СчетКредита;
			Движение.Период = Дата;
			Движение.Сумма = Выборка.Сумма;
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт,Движение.СубконтоДт,Выборка.СтатьяЗатрат);
			БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетКт,Движение.СубконтоКт,Поставщик);
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры
