
Процедура ПересчитатьСуммуДокумента()
   	Объект.СуммаДокумента = Объект.Услуги.Итог("Сумма");
 КонецПроцедуры


&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);  
    ПересчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);  
    ПересчитатьСуммуДокумента();


КонецПроцедуры



&НаСервере
Процедура ОбновлениеЦенВТабличнойЧасти()
	МассивНоменклатур = Новый Массив;
	Для Каждого ТекСтрока Из Объект.Услуги Цикл
	    МассивНоменклатур.Добавить(ТекСтрока.Номенклатура);
	КонецЦикла;	
	ЦеныНоменклатуры = РаботаСЦенами.ПолучитьМассивЦен1(Объект.Дата, Объект.Поставщик, МассивНоменклатур);
	Для Каждого ТекСтрока Из Объект.Услуги Цикл
	    НайденнаяЦена = ЦеныНоменклатуры.Найти(ТекСтрока.Номенклатура, "Номенклатура");
	    Если НайденнаяЦена = Неопределено Тогда
	        ТекСтрока.Цена = 0;
	    Иначе
	        ТекСтрока.Цена = НайденнаяЦена.Цена;
	    КонецЕсли;
	ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
	КонецЦикла;
	
	
КонецПроцедуры



&НаКлиенте
Процедура ОбновитьЦены(Команда)
	ОбновлениеЦенВТабличнойЧасти();
КонецПроцедуры
