
Процедура ПересчитатьСуммуДокумента()
   	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма")+ Объект.Товары.Итог("Сумма");
 КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;  
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
	ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Товары.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПокупкиНаДату(СтрокаТЧ.Номенклатура, Объект.Дата, Объект.Поставщик);
	Иначе
		СтрокаТЧ.Цена = 0;		
	КонецЕсли;
	РаботаСТабличнымиЧастями.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
    ПересчитатьСуммуДокумента();

КонецПроцедуры



&НаСервере
Процедура ОбновлениеЦенВТабличнойЧасти()
	МассивНоменклатур = Новый Массив;
	Для Каждого ТекСтрока Из Объект.Товары Цикл
	    МассивНоменклатур.Добавить(ТекСтрока.Номенклатура);
	КонецЦикла;	
	ЦеныНоменклатуры = РаботаСЦенами.ПолучитьМассивЦен1(Объект.Дата, Объект.Поставщик, МассивНоменклатур);
	Для Каждого ТекСтрока Из Объект.Товары Цикл
	    НайденнаяЦена = ЦеныНоменклатуры.Найти(ТекСтрока.Номенклатура, "Номенклатура");
	    Если НайденнаяЦена = Неопределено Тогда
	        ТекСтрока.Цена = 0;
	    Иначе
	        ТекСтрока.Цена = НайденнаяЦена.Цена;
	    КонецЕсли;
	ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
	КонецЦикла;
	
	
КонецПроцедуры



&НаКлиенте
Процедура ОбновитьЦены(Команда)
	ОбновлениеЦенВТабличнойЧасти();
	
	// не получилось через массив структур. не смог разобраться, как их обработать в модуле формы.
	//МассивЦен = РаботаСЦенами.ПолучитьМассивЦен(Объект.Дата, Объект.Поставщик);  
	//
	//Для каждого СтрокаТЧ из Объект.Товары Цикл
	//	Если СтрокаТЧ.Номенклатура = МассивЦен.Найти(СтрокаТЧ.Номенклатура) Тогда
	//		сообщить(1);
	//	Иначе
	//		Сообщить(0);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Для каждого ЭлементМассива из МассивЦен Цикл
	//	 сообщить(СТРШаблон("%1 %2",ЭлементМассива.Номенклатура, ЭлементМассива.Цена));
	//КонецЦикла;      
	 
КонецПроцедуры
