Процедура ОбработкаПроведения(Отказ, Режим)
    ЗапросТекущаяУчетнаяПолитика = Новый Запрос;
	ЗапросТекущаяУчетнаяПолитика.Текст ="ВЫБРАТЬ
	              |	УчетнаяПолитикаСрезПоследних.УчетнаяПолитика КАК УчетнаяПолитика
	              |ИЗ
	              |	РегистрСведений.УчетнаяПолитика.СрезПоследних(, ) КАК УчетнаяПолитикаСрезПоследних";		
	ВыборкаТекущаяУчетнаяПолитика = ЗапросТекущаяУчетнаяПолитика.Выполнить().Выбрать();
	ВыборкаТекущаяУчетнаяПолитика.Следующий();	
	Если УчетнаяПолитика = ВыборкаТекущаяУчетнаяПолитика.УчетнаяПолитика Тогда
		Сообщить("Текущая учетная политики соответствует устанавливаемой");
		Отказ = Истина;
	Иначе	
		Движения.УчетнаяПолитика.Записывать = Истина;
		Движение = Движения.УчетнаяПолитика.Добавить();
		Движение.Период = Дата;
		Движение.УчетнаяПолитика = УчетнаяПолитика;   
		
		Если УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.ПоСредней Тогда //1

		    Движения.ТоварыНаСкладах.Записывать = Истина; //2

		    Блокировка = Новый БлокировкаДанных; //3
		    ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
		    Блокировка.Заблокировать();

		    Запрос = Новый Запрос; //4
		    Запрос.Текст =
		    "ВЫБРАТЬ
		    |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		    |	ТоварыНаСкладахОстатки.Склад КАК Склад,
		    |	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
		    |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК Количество,
		    |	СУММА(ТоварыНаСкладахОстатки.СуммаОстаток) КАК Сумма
		    |ИЗ
		    |	РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментИтогов, ) КАК ТоварыНаСкладахОстатки
		    |
		    |СГРУППИРОВАТЬ ПО
		    |	ТоварыНаСкладахОстатки.Номенклатура,
		    |	ТоварыНаСкладахОстатки.Склад,
		    |	ТоварыНаСкладахОстатки.СрокГодности
		    |ИТОГИ
		    |	СУММА(Количество),
		    |	СУММА(Сумма)
		    |ПО
		    |	Номенклатура,
		    |	Склад";

		    Запрос.УстановитьПараметр("МоментИтогов", Новый Граница(МоментВремени())); //5
			
			ВыборкаИтогиВерх = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаИтогиВерх.Следующий() Цикл                                               
				ВыборкаИтоги = ВыборкаИтогиВерх.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаИтоги.Следующий() Цикл
				    Движение = Движения.ТоварыНаСкладах.ДобавитьПриход(); //8
				    Движение.Период = Дата;
				    ЗаполнитьЗначенияСвойств(Движение, ВыборкаИтоги,,"СрокГодности");	
					Выборка = ВыборкаИтоги.Выбрать();
					Пока Выборка.Следующий() Цикл
						Движение = Движения.ТоварыНаСкладах.ДобавитьРасход(); //7
				        Движение.Период = Дата;
				        ЗаполнитьЗначенияСвойств(Движение, Выборка);
					КонецЦикла;
			    КонецЦикла;
			
			
			КонецЦикла;
		КонецЕсли;   
	КонецЕсли;
КонецПроцедуры

