Функция ПроверитьОказаниеУслуг(ДокументЗК) Экспорт
	Запрос =Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументЗК);
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровИУслуг.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	               |ГДЕ
	               |	РеализацияТоваровИУслуг.ДокументОснование = &ДокументОснование
	               |	И РеализацияТоваровИУслуг.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровИУслуг.Ссылка";
	
	
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Если ЗначениеЗаполнено(Результат.Ссылка) Тогда
        Возврат Результат.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
