Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Ссылка) И УслугаОказана = Ложь Тогда
		УслугаОказана = Документы.ЗаписьКлиента.ПроверитьОказаниеУслуг(Ссылка);
	КонецЕсли;
	                  
	
	ДлительностьУслуг = РассчитатьДатуОкончанияЗаписи();
	Если ДлительностьУслуг = 0 Тогда // 1
	    ДлительностьУслуг = 60;
	КонецЕсли;
	ДатаОкончанияЗаписи = ДатаЗаписи + ДлительностьУслуг*60; 	
	
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗаказыКлиентов Приход
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Движение = Движения.ЗаказыКлиентов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.ЗаписьКлиента = Ссылка; 
	Движение.Сумма = Услуги.Итог("Сумма");

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Функция РассчитатьДатуОкончанияЗаписи()

ТЧУслуги = Услуги.Выгрузить(,"Номенклатура"); //1

Запрос = Новый Запрос;
Запрос.УстановитьПараметр("ТЧУслуги", ТЧУслуги); //2
Запрос.Текст=
"ВЫБРАТЬ
|    ТЧУслуги.Номенклатура КАК Номенклатура
|ПОМЕСТИТЬ ВТ_Номенклатура
|ИЗ
|    &ТЧУслуги КАК ТЧУслуги
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|    СУММА(Ном.ДлительностьУслуги) КАК ДлительностьУслуги
|ИЗ
|    ВТ_Номенклатура КАК ВТ_Номенклатура
|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
|        ПО ВТ_Номенклатура.Номенклатура = Ном.Ссылка";

Рез = Запрос.Выполнить();
Если Рез.Пустой() Тогда
    возврат 0;
КонецЕсли;

Выборка = Запрос.Выполнить().Выбрать();
Выборка.Следующий();
возврат Выборка.ДлительностьУслуги;

КонецФункции